load-test/scenarios/bookmark-course.yml
config:
  target: "http://localhost:8082"
  payload:
    path: "../data/users.csv"
    fields:
      - token
    order: random
    skipHeader: true
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 5
    - name: "Ramp up"
      duration: 60
      arrivalRate: 10
      rampTo: 50
    - name: "Sustained load"
      duration: 120
      arrivalRate: 50
  environments:
    # 인덱스 벤치마크용 (#379): 안정 상태 비교만 필요 — 회당 55초
    bench:
      phases:
        - name: "Warm up"
          duration: 10
          arrivalRate: 20
        - name: "Sustained load"
          duration: 45
          arrivalRate: 50
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: "course-list-bookmark"
    weight: 50
    flow:
      - get:
          url: "/api/courses/bookmarks"
          qs:
            townId: 2
          name: "GET /api/courses/bookmarks"
          headers:
            Authorization: "Bearer {{ token }}"

  - name: "course-folder-preview"
    weight: 50
    flow:
      - get:
          url: "/api/courses/bookmarks/folders"
          name: "GET /api/courses/bookmarks/folders"
          headers:
            Authorization: "Bearer {{ token }}"